first_name = "Дмитрий"
last_name = "Аносов"
print(
    f"""
\tЗдравствуйте! Меня зовут {last_name} {first_name}. Я обучаюсь в Компьютерной Академии TOP на курсе разработки Python.\n\n\tОбучение приносит удовольствие. Выбор онлайн формата оказался прекрасным решением. Так действительно удобнее для занятий.\n\n\tНам очень повезло с преподавателем Владимиром. Он отлично объясняет материал. Даёт много полезных дополнительных ресурсов. Практические занятия делают обучение ещё эффективнее.\n\n\tБлок Front-end оказался невероятно информативным. Продолжу углублять знания в этой области. Как говорится - «Нет предела совершенству». Особенно это актуально в данной сфере.\n\n\tНадеюсь, что в дальнейшем я смогу реализовать себя в этой сфере.\n\n\tТекущий формат занятий кажется идеальным. Всё организовано отлично."""
)
